v1/app/Controllers/Admin.php

                $usuario = 'u' . $idcard;

                $usuariosTable = $db->table('usuarios');
                $existente = $usuariosTable->where('idcard', $idcard)->get()->getRowArray();
---
SELECT *
FROM `usuarios`
WHERE `idcard` = '00595371'