v1/app/Controllers/Admin.php

SELECT *
FROM `grupo_avaliacao`
WHERE `id` = 1
---
    public function editarAvaliacao(int $id): string|ResponseInterface
    {
        $db = db_connect();

        if (! $db->tableExists('grupo_avaliacao')) {
            return redirect()->to('/admin/avaliations')->with('erro', 'Tabela grupo_avaliacao nao encontrada.');
        }

        $avaliacao = $db->table('grupo_avaliacao')->where('id', $id)->get()->getRowArray();

UPDATE `grupo_avaliacao` SET `nome_disciplina` = 'Classificação Decimal de Dewey', `data_inicio_avaliacao` = '2026-05-15', `data_fim_avaliacao` = '2026-05-15', `hora_inicio` = '08:00', `hora_fim` = '23:59', `duracao_prova_horas` = 4, `updated_at` = '2026-05-11 21:23:47'
WHERE `id` = 1
---
    public function updateAvaliacao(int $id): ResponseInterface
    {
        $db = db_connect();

        if (! $db->tableExists('grupo_avaliacao')) {
            return redirect()->to('/admin/avaliations')->with('erro', 'Tabela grupo_avaliacao nao encontrada.');
        }

        $avaliacao = $db->table('grupo_avaliacao')->where('id', $id)->get()->getRowArray();

        if ($avaliacao === null) {
            return redirect()->to('/admin/avaliations')->with('erro', 'Avaliacao nao encontrada.');
        }

        [$payload, $erros] = $this->validarDadosAvaliacao();

        if ($erros !== []) {
            return redirect()->back()->with('erro', implode(' ', $erros))->withInput();
        }

        $payload['updated_at'] = date('Y-m-d H:i:s');

        $db->table('grupo_avaliacao')
            ->where('id', $id)
            ->update($this->filtrarCamposGrupoAvaliacao($payload));