v1/app/Controllers/Admin.php

    public function editarAvaliacao(int $id): string|ResponseInterface
    {
        $db = db_connect();

        if (! $db->tableExists('grupo_avaliacao')) {
            return redirect()->to('/admin/avaliations')->with('erro', 'Tabela grupo_avaliacao nao encontrada.');
        }

        $avaliacao = $db->table('grupo_avaliacao')->where('id', $id)->get()->getRowArray();
---
SELECT *
FROM `grupo_avaliacao`
WHERE `id` = 1

                    continue;
                }

                $usuariosTable->insert([
                    'usuario' => $usuario,
                    'idcard' => $idcard,
                    'senha' => password_hash($idcard, PASSWORD_DEFAULT),
                    'primeiro_acesso' => 1,
                    'data_primeira_entrada' => null,
                    'is_admin' => 0,
                    'nome_completo' => $nome,
                    'created_at' => date('Y-m-d H:i:s'),
                    'updated_at' => date('Y-m-d H:i:s'),
                ]);
---
INSERT INTO `usuarios` (`usuario`, `idcard`, `senha`, `primeiro_acesso`, `data_primeira_entrada`, `is_admin`, `nome_completo`, `created_at`, `updated_at`) VALUES ('u00237543', '00237543', '$2y$10$L85VJrfeS5QkmNGkX5tUKOzjSsUl2TuIDYMWh72TYBm.vrJQhWUkS', 1, NULL, 0, 'PRISCILA', '2026-05-15 06:29:29', '2026-05-15 06:29:29')

    private function getOrCreateTipoResposta(object $db, string $tipoSlug, array &$tiposCache): int
    {
        if (isset($tiposCache[$tipoSlug])) {
            return $tiposCache[$tipoSlug];
        }

        $tipoTable = $db->table('tipos_resposta');
        $tipo = $tipoTable->where('slug', $tipoSlug)->get()->getRowArray();
---
SELECT *
FROM `tipos_resposta`
WHERE `slug` = 'multipla_escolha'

    private function upsertGrupoAvaliacao(object $db, string $disciplina): int
    {
        $grupoAvaliacaoTable = $db->table('grupo_avaliacao');
        $grupoAvaliacao = $grupoAvaliacaoTable->where('nome_disciplina', $disciplina)->get()->getRowArray();

        if ($grupoAvaliacao !== null) {
            return (int) $grupoAvaliacao['id'];
        }

        $grupoAvaliacaoTable->insert([
            'nome_disciplina' => $disciplina,
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ]);

        return (int) $db->insertID();
---
SELECT *
FROM `grupo_avaliacao`
WHERE `nome_disciplina` = 'Notação de Autor Cutter'
INSERT INTO `grupo_avaliacao` (`nome_disciplina`, `created_at`, `updated_at`) VALUES ('Notação de Autor Cutter', '2026-05-15 06:10:57', '2026-05-15 06:10:57')

    private function upsertQuestion(object $db, array $questionData): array
    {
        $questionsTable = $db->table('questions');
        $existing = $questionsTable
            ->where('enunciado_questao', $questionData['enunciado_questao'])
            ->get()
            ->getRowArray();

        if ($existing !== null) {
            // Se a pergunta ja existe, nao grava novamente.
            return [(int) $existing['id'], false];
        }

        $questionsTable->insert($questionData);

        return [(int) $db->insertID(), true];
---
SELECT *
FROM `questions`
WHERE `enunciado_questao` = 'Qual é a principal função da notação de autor Cutter?'
INSERT INTO `questions` (`enunciado_questao`, `tipo_resposta_id`, `resposta_correta`, `justificativa_resposta`, `resposta_1`, `resposta_2`, `resposta_3`, `resposta_4`, `resposta_5`, `nivel_dificuldade`, `created_at`, `updated_at`) VALUES ('Gere a notação de Cutter para o autor \"Silva\".', 3, 'S586', 'A letra inicial representa o sobrenome e os números mantêm a ordem alfabética.', NULL, NULL, NULL, NULL, NULL, 1, '2026-05-15 06:10:57', '2026-05-15 06:10:57')

    private function upsertGrupoQuestoes(object $db, string $nomeGrupo, array $idsQuestoes, ?int $grupoAvaliacaoId = null): int
    {
        $grupoQuestoesTable = $db->table('grupo_questoes');
        $grupoQuestoes = $grupoQuestoesTable->where('nome_grupo', $nomeGrupo)->get()->getRowArray();

        $payload = [
            'questoes_json' => json_encode($idsQuestoes, JSON_UNESCAPED_UNICODE),
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($grupoAvaliacaoId !== null && $this->campoExiste('grupo_questoes', 'grupo_avaliacao_id')) {
            $payload['grupo_avaliacao_id'] = $grupoAvaliacaoId;
        }

        if ($grupoQuestoes !== null) {
            $grupoQuestoesTable->where('id', (int) $grupoQuestoes['id'])->update($payload);

            return (int) $grupoQuestoes['id'];
        }

        $grupoQuestoesTable->insert($payload + [
            'nome_grupo' => $nomeGrupo,
            'created_at' => date('Y-m-d H:i:s'),
        ]);

        return (int) $db->insertID();
---
SELECT *
FROM `grupo_questoes`
WHERE `nome_grupo` = 'xml_cdd-00-cutter-00'
UPDATE `grupo_questoes` SET `questoes_json` = '[51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]', `updated_at` = '2026-05-15 06:22:21', `grupo_avaliacao_id` = 9
WHERE `id` = 1
INSERT INTO `grupo_questoes` (`questoes_json`, `updated_at`, `grupo_avaliacao_id`, `nome_grupo`, `created_at`) VALUES ('[51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100]', '2026-05-15 06:10:57', 5, 'xml_cdd-00-cutter-00', '2026-05-15 06:10:57')