v1/app/Controllers/Atividade.php

SELECT *
FROM `grupo_avaliacao`
WHERE `id` = 1
SELECT `id`
FROM `respostas`
WHERE `grupo_avaliacao_id` = 1
AND `usuario_id` = 12
 LIMIT 1
---
    public function show(int $id): string|ResponseInterface
    {
        $db = db_connect();

        $usuarioId = (int) (session('auth_user_id') ?? 0);

        if ($usuarioId <= 0) {
            return redirect()->to('/login')->with('erro', 'Voce precisa estar autenticado para acessar a atividade.');
        }

        if (! $db->tableExists('grupo_avaliacao')) {
            return $this->response
                ->setStatusCode(500)
                ->setJSON([
                    'status' => 'erro',
                    'mensagem' => 'Tabela grupo_avaliacao nao encontrada.',
                ]);
        }

        $grupo = $db->table('grupo_avaliacao')
            ->where('id', $id)
            ->get()
            ->getRowArray();

        if ($grupo === null) {
            throw PageNotFoundException::forPageNotFound('Grupo de avaliacao nao encontrado.');
        }

        if ($db->tableExists('respostas')) {
            $respostaExistente = $db->table('respostas')
                ->select('id')
                ->where('grupo_avaliacao_id', $id)
                ->where('usuario_id', $usuarioId)
                ->limit(1)
                ->get()
                ->getRowArray();

SELECT *
FROM `definicao_atividade`
WHERE `grupo_avaliacao_id` = 1
ORDER BY `id` DESC
---
        $atividades = [];

        if ($db->tableExists('definicao_atividade')) {
            $atividades = $db->table('definicao_atividade')
                ->where('grupo_avaliacao_id', $id)
                ->orderBy('id', 'DESC')
                ->get()
                ->getResultArray();

UPDATE `respostas` SET `resposta_texto` = 'teste 1', `updated_at` = '2026-05-15 04:43:19'
WHERE `id` = 1
AND `grupo_avaliacao_id` = 1
AND `usuario_id` = 12
---
            $respostaTexto = trim((string) $conteudo);
            $respostaTexto = $respostaTexto !== '' ? $respostaTexto : null;

            $atualizou = $db->table('respostas')
                ->where('id', $idResposta)
                ->where('grupo_avaliacao_id', $id)
                ->where('usuario_id', $usuarioId)
                ->update([
                    'resposta_texto' => $respostaTexto,
                    'updated_at' => $agora,
                ]);

SELECT `id`
FROM `respostas`
WHERE `grupo_avaliacao_id` = 1
AND `usuario_id` = 12
AND finalizado_em IS NOT NULL
 LIMIT 1
---
    private function avaliacaoFinalizada(object $db, int $grupoAvaliacaoId, int $usuarioId): bool
    {
        if (! $db->tableExists('respostas')) {
            return false;
        }

        if (! $this->campoExiste($db, 'respostas', 'finalizado_em')) {
            return false;
        }

        $registroFinalizado = $db->table('respostas')
            ->select('id')
            ->where('grupo_avaliacao_id', $grupoAvaliacaoId)
            ->where('usuario_id', $usuarioId)
            ->where('finalizado_em IS NOT NULL', null, false)
            ->limit(1)
            ->get()
            ->getRowArray();

SELECT MIN(created_at) AS inicio_avaliacao
FROM `respostas`
WHERE `grupo_avaliacao_id` = 1
AND `usuario_id` = 12
---
    private function obterInicioAvaliacaoPorResposta(object $db, int $grupoAvaliacaoId, int $usuarioId): ?string
    {
        if (! $db->tableExists('respostas')) {
            return null;
        }

        $linha = $db->table('respostas')
            ->select('MIN(created_at) AS inicio_avaliacao', false)
            ->where('grupo_avaliacao_id', $grupoAvaliacaoId)
            ->where('usuario_id', $usuarioId)
            ->get()
            ->getRowArray();

SELECT `r`.`id` AS `resposta_id`, `r`.`resposta_texto`, `q`.`id` AS `question_id`, `q`.`enunciado_questao`, `q`.`resposta_1`, `q`.`resposta_2`, `q`.`resposta_3`, `q`.`resposta_4`, `q`.`resposta_5`
FROM `respostas` `r`
INNER JOIN `questions` `q` ON `q`.`id` = `r`.`question_id`
WHERE `r`.`grupo_avaliacao_id` = 1
AND `r`.`usuario_id` = 12
ORDER BY `r`.`id` ASC
---
    private function carregarQuestoesSelecionadas(object $db, int $grupoAvaliacaoId, int $usuarioId): array
    {
        if (! $db->tableExists('respostas') || ! $db->tableExists('questions')) {
            return [];
        }

        return $db->table('respostas r')
            ->select('r.id AS resposta_id, r.resposta_texto, q.id AS question_id, q.enunciado_questao, q.resposta_1, q.resposta_2, q.resposta_3, q.resposta_4, q.resposta_5')
            ->join('questions q', 'q.id = r.question_id', 'inner')
            ->where('r.grupo_avaliacao_id', $grupoAvaliacaoId)
            ->where('r.usuario_id', $usuarioId)
            ->orderBy('r.id', 'ASC')
            ->get()
            ->getResultArray();

SELECT `id`, `questoes_json`
FROM `grupo_questoes`
WHERE `id` = 1
---
    private function gerarRespostasIniciais(object $db, array $grupo, int $grupoAvaliacaoId, int $usuarioId): void
    {
        if (! $db->tableExists('grupo_questoes') || ! $db->tableExists('questions')) {
            return;
        }

        $idsQuestoesSorteadas = [];

        for ($indice = 1; $indice <= 10; $indice++) {
            $campoGrupoQuestoes = 'grupo_questoes_querstao_' . $indice;
            $campoQuantidade = 'qq' . $indice;

            $grupoQuestoesId = (int) ($grupo[$campoGrupoQuestoes] ?? 0);
            $quantidadeQuestoes = (int) ($grupo[$campoQuantidade] ?? 1);

            if ($grupoQuestoesId <= 0 || $quantidadeQuestoes <= 0) {
                continue;
            }

            $grupoQuestoes = $db->table('grupo_questoes')
                ->select('id, questoes_json')
                ->where('id', $grupoQuestoesId)
                ->get()
                ->getRowArray();

SELECT `id`
FROM `questions`
WHERE `id` IN (51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100)
---
                continue;
            }

            $questoesDisponiveis = $db->table('questions')
                ->select('id')
                ->whereIn('id', $idsQuestoesDoGrupo)
                ->get()
                ->getResultArray();

SELECT `question_id`
FROM `respostas`
WHERE `grupo_avaliacao_id` = 1
AND `usuario_id` = 12
AND `question_id` IN (94,95,86,340,346,301,7,1,32,38,105,123,122,113,176,184,151,239,215,221,255,261)
---
            return;
        }

        $idsJaRespondidos = $db->table('respostas')
            ->select('question_id')
            ->where('grupo_avaliacao_id', $grupoAvaliacaoId)
            ->where('usuario_id', $usuarioId)
            ->whereIn('question_id', $idsQuestoesSorteadas)
            ->get()
            ->getResultArray();

INSERT INTO `respostas` (`created_at`, `grupo_avaliacao_id`, `question_id`, `resposta_texto`, `updated_at`, `usuario_id`)
VALUES ('2026-05-15 06:23:09',1,94,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,95,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,86,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,340,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,346,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,301,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,7,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,1,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,32,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,38,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,105,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,123,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,122,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,113,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,176,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,184,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,151,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,239,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,215,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,221,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,255,NULL,'2026-05-15 06:23:09',12), ('2026-05-15 06:23:09',1,261,NULL,'2026-05-15 06:23:09',12)
---
        }

        if ($payload !== []) {
            $db->table('respostas')->insertBatch($payload);