v1/app/Controllers/Atividade.php

    private function carregarQuestoesSelecionadas(object $db, int $grupoAvaliacaoId, int $usuarioId): array
    {
        if (! $db->tableExists('respostas') || ! $db->tableExists('questions')) {
            return [];
        }

        return $db->table('respostas r')
            ->select('r.id AS resposta_id, r.resposta_texto, q.id AS question_id, q.enunciado_questao, q.resposta_1, q.resposta_2, q.resposta_3, q.resposta_4, q.resposta_5')
            ->join('questions q', 'q.id = r.question_id', 'inner')
            ->where('r.grupo_avaliacao_id', $grupoAvaliacaoId)
            ->where('r.usuario_id', $usuarioId)
            ->orderBy('r.id', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `r`.`id` AS `resposta_id`, `r`.`resposta_texto`, `q`.`id` AS `question_id`, `q`.`enunciado_questao`, `q`.`resposta_1`, `q`.`resposta_2`, `q`.`resposta_3`, `q`.`resposta_4`, `q`.`resposta_5`
FROM `respostas` `r`
INNER JOIN `questions` `q` ON `q`.`id` = `r`.`question_id`
WHERE `r`.`grupo_avaliacao_id` = 1
AND `r`.`usuario_id` = 12
ORDER BY `r`.`id` ASC