v1/app/Controllers/Auth.php

SELECT *
FROM `usuarios`
WHERE `idcard` = '00282381'
---
    public function autenticar()
    {
        $idcard = trim((string) $this->request->getPost('idcard'));
        $senha = (string) $this->request->getPost('senha');

        if (! preg_match('/^\d{8}$/', $idcard)) {
            return redirect()->back()->with('erro', 'Informe um ID do cracha com 8 digitos.')->withInput();
        }

        $db = db_connect();

        if (! $db->tableExists('usuarios')) {
            return redirect()->back()->with('erro', 'Tabela de usuarios nao encontrada. Execute as migrations.');
        }

        $usuario = $db->table('usuarios')->where('idcard', $idcard)->get()->getRowArray();